{
    "nitofact1": {
        "en": {
            "title": "NitoFact # 1 - Did you know...",
            "content": "The Nito blockchain was launched on Saturday, 21st August 2024. Its Genesis block is encoded with \"Nito/Core Genesis 8-4.\". Nito was launched fairly with no pre-mine and the source code and binaries were immediately published to the Github repositary for anyone to install and begin mining.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact2": {
        "en": {
            "title": "NitoFact # 2 - Did you know...",
            "content": "Nito has a fixed supply of just over 1.158 billion coins (1,158,422,400 NITO). Distribution spans 200 years giving multiple generations the opportunity to mine coins. 60% of the total supply will have been distributed at the end of Nitos first decade, with the remaining 40% distributed over the next 190 years.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact3": {
        "en": {
            "title": "NitoFact # 3 - Did you know...",
            "content": "Nito blocks are mined approximately once every 60 seconds, allowing for fast confirmation of transactions. The 1 minute block time was chosen as it provided an optimal balance between speed and security. Less than one minute and the chain sees more orphaned and empty blocks. More than one minute and confirmation times become very long.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact4": {
        "en": {
            "title": "NitoFact # 4 - Did you know...",
            "content": "The economic model of Nito is built for long-term sustainability. The total supply of 1.158 Billion NITO (1,158,422,400 NITO) will be distributed over 200 years. This allows Nito to maintain steady and predictable growth, giving multiple generations the opportunity to mine and accumulate coins.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact5": {
        "en": {
            "title": "NitoFact # 5 - Did you know...",
            "content": "A single Nito can be divided up to 8 decimal places. The smallest unit of NITO is a Nitoshi. There are are 100,000,000 Nitoshi in 1 NITO. The name Nitoshi takes inspiration from a Satoshi, Bitcoin's smallest unit.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact6": {
        "en": {
            "title": "NitoFact # 6 - Did you know...",
            "content": "The 200 year, multi-generational distribution of NITO coins means that the unfair advantage given to early adopters of other blockchains is minimized.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact7": {
        "en": {
            "title": "NitoFact # 7 - Did you know...",
            "content": "The official website for the Nito blockchain can be found at",
            "url": "https://nito.network",
            "link_social": ": https://nito.network",
            "link_html": " <a target=\"_blank\" href=\"https://nito.network\">here</a>.",
            "link_md": " [https://nito.network](https://nito.network)."
        }
    },
    "nitofact8": {
        "en": {
            "title": "NitoFact # 8 - Did you know...",
            "content": "The Nito codebase is a lightly modified version of Bitcoin Core. It takes the best features of Bitcoin 27, removes legacy code, and addresses Bitcoin's shortcomings to improve speed and efficiency. Segwit, bech32 and taproot are enabled by default. Base58 segwit and base58 legacy are removed. This makes Nito blocks as efficient as possible.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact9": {
        "en": {
            "title": "NitoFact # 9 - Did you know...",
            "content": "Nito features a real-time difficulty adjustment algorithm that was written specifically for Nito. It is designed to efficiently and automatically adjust the difficulty after each block, preventing periods of rapid or very slow block creation that can follow sudden, dramatic changes in network hashrate. This results in a more stable and reliable experience for both users, miners and developers.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact10": {
        "en": {
            "title": "NitoFact # 10 - Did you know...",
            "content": "Like Bitcoin, Nito uses the SHA256 mining algorithm. SHA256 was chosen due to its robustness, security, and efficiency. SHA256 mining hardware is widely available allowing anyone to easily participate, and existing Bitcoin mining infrastructure can be easily adapted to add support for Nito.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact11": {
        "en": {
            "title": "NitoFact # 11 - Did you know...",
            "content": "There are currently approximately $block_height blocks in the Nito blockchain. The next major milestone will take place in $milestone_next_days days when the Nito blockchain will pass $milestone_next_mil Million blocks! This will happen at approximately $milestone_next_time on $milestone_next_date.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact12": {
        "en": {
            "title": "NitoFact # 12 - Did you know...",
            "content": "There is no founders reward with the Nito blockchain. The reward for mining each block only ever goes to whoever mined it. No part of it goes to anyone else.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact13": {
        "en": {
            "title": "NitoFact # 13 - Did you know...",
            "content": "The Nito Core software is incredibly lean and effient. It currently requires less than 1Gb RAM and under 5Gb disk space. This makes running Nito Core very inexpensive - be it in the cloud on a VPS or a low power device such as a single-board computer (Raspberry Pi etc.).",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact14": {
        "en": {
            "title": "NitoFact # 14 - Did you know...",
            "content": "Nito's current block reward is $block_reward_current NITO. This is the reward given to the miner who secures each block on the Nito blockchain. The next \"halving\" will be in $next_halving_days days when the block reward will drop to $block_reward_next NITO per block. This will occur at approximately $next_halving_time on $next_halving_date.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact15": {
        "en": {
            "title": "NitoFact # 15 - Did you know...",
            "content": "There are currently $circ_supply_coins NITO in circulation which is $circ_supply_percent of the 1.158 Billion NITO total supply (1,158,422,400 NITO). Currently, $block_reward_current NITO enter the supply each minute as miners work to secure the network. It will take 200 years for the total supply of NITO to be distributed.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact16": {
        "en": {
            "title": "NitoFact # 16 - Did you know...",
            "content": "All existing software built for Bitcoin will work with Nito, with only a few small changes. This makes it easy to make Nito work with established software. Furthermore, all Bitcoin miners can be used to mine NITO since they use the same algorithm, SHA256.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    },
    "nitofact17": {
        "en": {
            "title": "NitoFact # 17 - Did you know...",
            "content": "The default listening port for Nito Core is 8820 for mainnet and 8840 for testnet. If you are running a Nito node, make sure you have opened the appropriate ports on your router so that other nodes can connect to you.",
            "url": "",
            "link_social": "",
            "link_html": "",
            "link_md": ""
        }
    }
     
}


 